In [1]:
import pandas as pd 
import numpy as np

In [2]:
Dict = {'Rollno':[1,2,3,4,5],
        'Names':['Sam','Dam','Ram','Aan','Zan'],
        'Math':[50,60,70,80,np.nan],
        'Eng':[60,70,80,np.nan,50],
        'Social':[70,80,np.nan,50,60],
        'Geo':[80,np.nan,50,60,70],
        'Science':[np.nan,50,60,70,80]}

In [3]:
df=pd.DataFrame(Dict)
df

   Rollno Names  Math   Eng  Social   Geo  Science
0       1   Sam  50.0  60.0    70.0  80.0      NaN
1       2   Dam  60.0  70.0    80.0   NaN     50.0
2       3   Ram  70.0  80.0     NaN  50.0     60.0
3       4   Aan  80.0   NaN    50.0  60.0     70.0
4       5   Zan   NaN  50.0    60.0  70.0     80.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rollno   5 non-null      int64
 1   Names    5 non-null      object
 2   Math     4 non-null      float64
 3   Eng      4 non-null      float64
 4   Social   4 non-null      float64
 5   Geo      4 non-null      float64
 6   Science  4 non-null      float64
dtypes: float64(5), int64(1), object(1)
memory usage: 408.0+ bytes

In [5]:
df.describe()

         Rollno       Math        Eng     Social        Geo    Science
count  5.000000   4.000000   4.000000   4.000000   4.000000   4.000000
mean   3.000000  65.000000  65.000000  65.000000  65.000000  65.000000
std    1.581139  12.909944  12.909944  12.909944  12.909944  12.909944
min    1.000000  50.000000  50.000000  50.000000  50.000000  50.000000
25%    2.000000  57.500000  57.500000  57.500000  57.500000  57.500000
50%    3.000000  65.000000  65.000000  65.000000  65.000000  65.000000
75%    4.000000  72.500000  72.500000  72.500000  72.500000  72.500000
max    5.000000  80.000000  80.000000  80.000000  80.000000  80.000000

In [6]:
df.isnull().sum()

Rollno     0
Names      0
Math       1
Eng        1
Social     1
Geo        1
Science    1
dtype: int64

To fill data below null value as same of upper

In [7]:
# df.fillna(method ='pad')

To fill data above same as lower

In [8]:
# df.fillna(method='bfill')

In [9]:
# filling a null values using fillna()
df["Math"].fillna(45, inplace = False)
df["Eng"].fillna(55, inplace = False)
df["Science"].fillna(65, inplace = False)
df["Social"].fillna(75, inplace = False)
df["Geo"].fillna(85, inplace = False)

0    80.0
1    85.0
2    50.0
3    60.0
4    70.0
Name: Geo, dtype: float64

In [11]:
# filling a null values using fillna()

df["Math"].fillna(int(df["Math"].mean()), inplace=True)

In [12]:
# using dropna() function 
# df.dropna()

In [13]:
# making new data frame with dropped NA values
df2 = df.dropna(axis = 1)

In [14]:
df2

   Rollno Names  Math
0       1   Sam  50.0
1       2   Dam  60.0
2       3   Ram  70.0
3       4   Aan  80.0
4       5   Zan  65.0

In [15]:
df3 = df.dropna(axis = 0)
df3

   Rollno Names  Math   Eng  Social   Geo  Science
4       5   Zan  65.0  50.0    60.0  70.0     80.0

In [16]:
df["Math"].fillna(45, inplace = True)
df["Eng"].fillna(55, inplace = True)
df["Science"].fillna(65, inplace = True)
df["Social"].fillna(75, inplace = True)
df["Geo"].fillna(85, inplace = True)
df

   Rollno Names  Math   Eng  Social   Geo  Science
0       1   Sam  50.0  60.0    70.0  80.0     65.0
1       2   Dam  60.0  70.0    80.0  85.0     50.0
2       3   Ram  70.0  80.0    75.0  50.0     60.0
3       4   Aan  80.0  55.0    50.0  60.0     70.0
4       5   Zan  65.0  50.0    60.0  70.0     80.0

# OUTLIERS

In [17]:

# Inter Qurtile Range (IQR)

import sklearn


''' Detection '''
# IQR

Q1 = np.percentile(df['Geo'], 25, interpolation = 'midpoint')

Q3 = np.percentile(df['Geo'], 75, interpolation = 'midpoint')
IQR = Q3 - Q1


print("Old Shape: ", df.shape)

# Upper bound
upper = np.where(df['Geo'] >= (Q3+1.5*IQR))
# Lower bound
lower = np.where(df['Geo'] <= (Q1-1.5*IQR))

''' Removing the Outliers '''
df.drop(upper[0], inplace = True)
df.drop(lower[0], inplace = True)

print("New Shape: ", df.shape)

print("Upper bound :",upper)
print("lower bound :",lower)

Old Shape:  (5, 7)
New Shape:  (5, 7)
Upper bound : (array([], dtype=int64),)
lower bound : (array([], dtype=int64),)

/var/folders/z6/40r9qmyn6d9cft3g1q1nwvdw0000gn/T/ipykernel_52988/4267291837.py:9: DeprecationWarning: the `interpolation=` argument to percentile was renamed to `method=`, which has additional options.
Users of the modes 'nearest', 'lower', 'higher', or 'midpoint' are encouraged to review the method they used. (Deprecated NumPy 1.22)
  Q1 = np.percentile(df['Geo'], 25, interpolation = 'midpoint')
/var/folders/z6/40r9qmyn6d9cft3g1q1nwvdw0000gn/T/ipykernel_52988/4267291837.py:11: DeprecationWarning: the `interpolation=` argument to percentile was renamed to `method=`, which has additional options.
Users of the modes 'nearest', 'lower', 'higher', or 'midpoint' are encouraged to review the method they used. (Deprecated NumPy 1.22)
  Q3 = np.percentile(df['Geo'], 75, interpolation = 'midpoint')

The <b>Z-score</b>, also known as standard score, is a statistical measure that quantifies the number of
standard deviations a data point is from the mean of a distribution. It is used to standardize and 
compare data points across different distributions.

The formula to calculate the Z-score of a data point, given its value x, mean μ, and 
standard deviation σ, is:

## Z = (x - μ) / σ

The Z-score indicates how many standard deviations a data point is above or below the mean. A positive Z-score means the data point is above the mean, while a negative Z-score means it is below the mean.

In [18]:
# Z score


from scipy import stats
import numpy as np
 
z = np.abs(stats.zscore(df['Math']))
print(z)

0    1.5
1    0.5
2    0.5
3    1.5
4    0.0
Name: Math, dtype: float64

In [19]:
threshold = 3
 
# Position of the outlier
print(np.where(z > 3))

(array([], dtype=int64),)

# Transformation

The transformed column "Math_transformed" contains the logarithmic values of the "Math" column. This transformation can help decrease skewness and approximate a normal distribution for the variable.

In [20]:
df['Math_transformed'] = np.log(df['Math'])

In [21]:
df

   Rollno Names  Math   Eng  Social   Geo  Science  Math_transformed
0       1   Sam  50.0  60.0    70.0  80.0     65.0          3.912023
1       2   Dam  60.0  70.0    80.0  85.0     50.0          4.094345
2       3   Ram  70.0  80.0    75.0  50.0     60.0          4.248495
3       4   Aan  80.0  55.0    50.0  60.0     70.0          4.382027
4       5   Zan  65.0  50.0    60.0  70.0     80.0          4.174387

<b>Logarithmic Transformation:</b>

        Apply a logarithmic function (e.g., np.log) to the variable.
        This transformation is suitable for positively skewed data.

<b>Square Root Transformation:</b>

        Apply a square root function (e.g., np.sqrt) to the variable.
        This transformation is suitable for positively skewed data.

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

<b>1) Logarithmic Transformation:</b>

      If the relationship between the variables is exponential, taking the logarithm of one or both variables can often linearize the relationship.
      For example, if you have variables x and y and suspect that the relationship is of the form y = a * exp(b * x), you can transform the equation to log(y) = log(a) + b * x, which is a linear equation.


<b>2) Square Root Transformation:</b>

     If the relationship is quadratic (i.e., y = a * x^2 + b * x + c), taking the square root of y or x (or both) can linearize the relationship.
     For example, if you have y = a * x^2 + b * x + c, you can transform it to sqrt(y) = sqrt(a) * x + sqrt(b) * sqrt(x) + sqrt(c), which is a linear equation.



<b>3) Reciprocal Transformation:</b>

    If the relationship is inverse (i.e., y = a / x), taking the reciprocal of y or x can linearize the relationship.
    For example, if you have y = a / x, you can transform it to 1/y = a * (1/x), which is a linear equation.


<b>4) Polynomial Transformation:</b>

    If the relationship is polynomial of higher degree (e.g., y = a * x^3 + b * x^2 + c * x + d), you can create additional polynomial terms by raising x to different powers, and then fit a linear regression model using these new terms as features.
    
    
    
    Remember, the choice of transformation depends on the specific relationship between the variables. You may need to explore and experiment with different transformations to find the one that linearizes the relationship most effectively. Additionally, it's important to interpret the results of the transformed variables in the context of the original problem to ensure the transformed relationship makes sense.

# Extra

In [ ]:
result = df.transform(func = ['sqrt', 'exp'])
result

# Skewness

In [ ]:
df.skew()